let chars = ["", ..."ாிீுூெேைொோௌ்"].flatMap((i, v) =>
  [..."கஙசஞடணதநபமயரலவழளறனஜஷஸஹ", ""].map((j, c) => [
    !j ? [..."அஆஇஈஉஊஎஏஐஒஓஔஃ"][v] : j + i,
    ...[
      ["k", "g"],
      ["n"],
      ["ch", "s", "j"],
      ["n"],
      ["d", "t"],
      ["n"],
      ["th"],
      ["n"],
      ["p", "b"],
      ["m"],
      ["y"],
      ["r"],
      ["l"],
      ["v"],
      ["l"],
      ["l"],
      ["r"],
      ["n"],
      ["j"],
      ["sh"],
      ["s"],
      ["h"],
      [""],
    ][c].map(
      (k) => (!j ? "" : k) + "a,aa,i,ee,u,uu,e,ae,ai,o,oo,au,".split(",")[v]
    ),
  ])
);
export default chars;
